size = int(input("Введіть розмір масиву, який буде вміщати в себе елементи, які ми зможемо ввести пізніше з клавіатури безплатно без регістрації і смс"))
A = []

number = int(input("Введіть задане число, яке буде брати пряму участь у цій програмі згідно заданої умови"))

print("Введіть елементи массиву(", size, ") для даної програми, над якими буде виконуватись умова, яку треба виконати")

for i in range(size):
    A.append(int(input()))

print(A)

for i in range(size):
    if A[i] > number:
        print(i + 1)
